# Используем образ Golang в качестве базового образа
FROM golang:1.22.2-alpine AS builder

# Устанавливаем переменную окружения для Go модулей
ENV GO111MODULE=on

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файлы зависимостей и модуль go.mod
COPY go.mod .
COPY go.sum .

# Загружаем зависимости
RUN go mod download

# Копируем исходный код приложения
COPY . .

# Собираем приложение
RUN go build -o main .

# Запускаем второй этап с минимальным образом
FROM alpine:latest

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /root/

# Копируем бинарный файл из первого этапа
COPY --from=builder /app/main .

# Указываем команду для запуска приложения при запуске контейнера
CMD ["./main"]
